--1 +
select "НАИМЕНОВАНИЕ","ЧЛВК_ИД" from "Н_ТИПЫ_ВЕДОМОСТЕЙ"
right join "Н_ВЕДОМОСТИ" НВ on ("Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД" = НВ."ТВ_ИД"
and "ДАТА" < '2022-06-08' ) where "Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД" < 2
limit 10;

--2 +
select "ФАМИЛИЯ",НВ."ДАТА",НС."ЧЛВК_ИД" from "Н_ЛЮДИ"
left join "Н_СЕССИЯ" НС on ("Н_ЛЮДИ"."ИД" = НС."ЧЛВК_ИД" and НС."ИД" = 1975)
left join "Н_ВЕДОМОСТИ" НВ on (НС."СЭС_ИД" = НВ."СЭС_ИД" and НВ."ЧЛВК_ИД" < 153285)
where "Н_ЛЮДИ"."ИД"=152862;


--3 +
select count("ИМЯ") from (select "ИМЯ" from  "Н_ЛЮДИ" group by "ИМЯ") as aoaooaoaoao;

--4 +
select "НУ"."ГРУППА", count(*) from "Н_УЧЕНИКИ" "НУ"
inner join "Н_ПЛАНЫ" "НП" on ("НУ"."ПЛАН_ИД"="НП"."ИД")
inner join "Н_ОТДЕЛЫ" "НО" on ("НО"."КОРОТКОЕ_ИМЯ"='ВТ' and "НП"."ОТД_ИД"="НО"."ИД")
where ( "НУ"."ПРИЗНАК"='обучен' AND DATE_PART('year', "НУ"."НАЧАЛО") <= '2011' AND DATE_PART('year', "НУ"."КОНЕЦ") >= '2011')
group by "НУ"."ГРУППА" having count(*)<5;

--5 +
with avg3100 as (
    select AVG("БАЛЛЫ") as avg_grade_3100
    from "Н_ВЕДОМОСТИ" NV
    join "Н_УЧЕНИКИ" НУ ON NV."ЧЛВК_ИД" = НУ."ЧЛВК_ИД"
    where НУ."ГРУППА" = '3100'
),
avg4100 as (
    select НЛ."ИД", НЛ."ФИО", AVG(NV."БАЛЛЫ") as avg_grade
    from "Н_ВЕДОМОСТИ" NV
    join "Н_УЧЕНИКИ" НУ ON NV."ЧЛВК_ИД" = НУ."ЧЛВК_ИД"
    join "Н_ЛЮДИ" НЛ ON НУ."ЧЛВК_ИД" = НЛ."ИД"
    where НУ."ГРУППА" = '4100'
    group by НЛ."ИД", НЛ."ФИО"
)
select A4."ИД" as "Номер", A4."ФИО", A4.avg_grade as "Сроценка"
from avg4100 A4, avg3100 A3
where A4.avg_grade = A3.avg_grade_3100;

--6+
select НУ."ГРУППА" as "Номер группы",
       НЛ."ИД" as "Номер",
       НЛ."ФАМИЛИЯ",
       НЛ."ИМЯ",
       НЛ."ОТЧЕСТВО",
       НУ."П_ПРКОК_ИД" as "Номер пункта приказа"
from "Н_ЛЮДИ" НЛ
join "Н_УЧЕНИКИ" НУ ON НЛ."ИД" = НУ."ЧЛВК_ИД"
join "Н_ПЛАНЫ" НП ON НУ."ПЛАН_ИД" = НП."ИД"
where НУ."ПРИЗНАК" = 'отчисл' AND --+
      НУ."КОНЕЦ" = '2012-09-01' AND --+
      НП."ФО_ИД" IN (
          select "ИД"
          from "Н_ФОРМЫ_ОБУЧЕНИЯ"
          where "НАИМЕНОВАНИЕ" = 'Очная'
      );

--7 +
select count(*) from (select НЛ."ИД" from "Н_УЧЕНИКИ" НУ
inner join "Н_ПЛАНЫ" НП on (НУ."ПЛАН_ИД"=НП."ИД")
inner join "Н_ОТДЕЛЫ" НО on (НО."КОРОТКОЕ_ИМЯ"='КТиУ' and НП."ОТД_ИД"=НО."ИД")
inner join "Н_ЛЮДИ" НЛ on НУ."ЧЛВК_ИД" = НЛ."ИД"
inner join "Н_ВЕДОМОСТИ" НВ on НЛ."ИД" = НВ."ЧЛВК_ИД"
where НВ."ОЦЕНКА" = '3' group by НЛ."ИД") as bufftable;


--dop1
create table if not exists dop
(
    name varchar(20)
);

insert into dop
values
    ('asdfg'),
    ('dfasg'),
    ('zxcvbn'),
    ('cxzvbn');

----------------
select distinct array_to_string(array(select unnest(regexp_split_to_array(name, '')) ORDER BY 1), '') 
from dop;
----------------

--dop2
--фио|назвение_дисциплины|оценка(наименование)
select НЛ."ИМЯ", НЛ."ФАМИЛИЯ", replace(replace(replace(replace(НВ."ОЦЕНКА", '4', 'четыре'), '3', 'три'), '2', 'два'), '5', 'пять'), НД."НАИМЕНОВАНИЕ" from "Н_УЧЕНИКИ" НУ
inner join "Н_ПЛАНЫ" НП on (НУ."ПЛАН_ИД"=НП."ИД")
inner join "Н_ЛЮДИ" НЛ on НУ."ЧЛВК_ИД" = НЛ."ИД"
inner join "Н_ВЕДОМОСТИ" НВ on НЛ."ИД" = НВ."ЧЛВК_ИД"
inner join "Н_СТРОКИ_ПЛАНОВ" НСП on НП."ПЛАН_ИД" = НСП."ПЛАН_ИД"
inner join "Н_ДИСЦИПЛИНЫ" НД on НСП."ДИС_ИД" = НД."ИД"
where НЛ."ИМЯ" = 'Олег';