#1
select "НАИМЕНОВАНИЕ","ЧЛВК_ИД" FROM "Н_ТИПЫ_ВЕДОМОСТЕЙ"
right join "Н_ВЕДОМОСТИ" НВ on ("Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД" = НВ."ТВ_ИД"
and "ДАТА" < '2022-06-08' ) where "Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД" < 2;



#2
select "ФАМИЛИЯ",НВ."ДАТА",НС."ЧЛВК_ИД" from "Н_ЛЮДИ"
left join "Н_СЕССИЯ" НС on ("Н_ЛЮДИ"."ИД" = НС."ЧЛВК_ИД" and НС."ИД" = 1975)
left join "Н_ВЕДОМОСТИ" НВ on (НС."СЭС_ИД" = НВ."СЭС_ИД" and НВ."ЧЛВК_ИД" < 153285)
where "Н_ЛЮДИ"."ИД"=152862;


#3
select count("ИМЯ") from (select "ИМЯ" from  "Н_ЛЮДИ" group by "ИМЯ") as aoaooaoaoao;

#4
select "НУ"."ГРУППА", count(*) from "Н_УЧЕНИКИ" "НУ"
inner join "Н_ПЛАНЫ" "НП" on ("НУ"."ПЛАН_ИД"="НП"."ИД")
inner join "Н_ОТДЕЛЫ" "НО" on ("НО"."КОРОТКОЕ_ИМЯ"='ВТ' and "НП"."ОТД_ИД"="НО"."ИД")
where ( "НУ"."ПРИЗНАК"='обучен' AND DATE_PART('year', "НУ"."НАЧАЛО") <= '2011' AND DATE_PART('year', "НУ"."КОНЕЦ") >= '2011')
group by "НУ"."ГРУППА" having count(*)<5;

#7
select count(*) from (select НЛ."ИД" FROM "Н_УЧЕНИКИ" НУ
inner join "Н_ПЛАНЫ" НП on (НУ."ПЛАН_ИД"=НП."ИД")
inner join "Н_ОТДЕЛЫ" НО on (НО."КОРОТКОЕ_ИМЯ"='КТиУ' and НП."ОТД_ИД"=НО."ИД")
inner join "Н_ЛЮДИ" НЛ on НУ."ЧЛВК_ИД" = НЛ."ИД"
inner join "Н_ВЕДОМОСТИ" НВ on НЛ."ИД" = НВ."ЧЛВК_ИД"
where НВ."ОЦЕНКА" = '3' group by НЛ."ИД") as bufftable;