select "НАИМЕНОВАНИЕ","ЧЛВК_ИД" FROM "Н_ТИПЫ_ВЕДОМОСТЕЙ"
right join "Н_ВЕДОМОСТИ" НВ on ("Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД" = НВ."ТВ_ИД"
and "ДАТА" < '2022-06-08' ) where "Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД" < 2;




select "ФАМИЛИЯ",НВ."ДАТА",НС."ЧЛВК_ИД" from "Н_ЛЮДИ"
left join "Н_СЕССИЯ" НС on ("Н_ЛЮДИ"."ИД" = НС."ЧЛВК_ИД" and НС."ИД" = 1975)
left join "Н_ВЕДОМОСТИ" НВ on (НС."СЭС_ИД" = НВ."СЭС_ИД" and НВ."ЧЛВК_ИД" < 153285)
where "Н_ЛЮДИ"."ИД"=152862;



select count("ИМЯ") from (select "ИМЯ" from  "Н_ЛЮДИ" group by "ИМЯ") as aoaooaoaoao;

